---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.ReynoldsNumber
source: html/e764d373-5cd0-ef39-4706-923e6fd2e3bb.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.ReynoldsNumber Property

The reynolds number of the pipe.

## Syntax (C#)
```csharp
public double ReynoldsNumber { get; set; }
```